""" Задача: Анализатор оценок студентов
    Напиши программу, которая:
        1. Просит пользователя ввести имя студента
        2. Просит ввести 5 оценок (числа от 1 до 5)
        3. Вычисляет средний балл
        4. Выводит результаты в формате:
        - Студент: [имя]
        - Оценки: [список через запятую]
        - Средний балл: [число с 2 десятичными местами]
        - Статус: в зависимости от среднего балла:
            - ≥ 4.5 → "Отличник"
            - ≥ 3.5 → "Хорошист"
            - ≥ 2.5 → "Удовлетворительно"
            - < 2.5 → "Нужна помощь"
"""
