""" Задача: Дан список чисел.
        Необходимо суммировать крайние элементы (первый и последний).
        Суммировать все остальные элементы в отдельный результат.
        Вывести результаты в виде кортежа (сумма крайних элементов, сумма всех остальных).
"""

result = sum([1, 2, 3, 4])
print(result)
